<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'يجب قبول السمة.',
    'accepted_if' => 'يجب قبول السمة عندما يكون الآخر هو القيمة.',
    'active_url' => 'السمة ليست عنوان URL صالحًا.',
    'after' => 'يجب أن تكون السمة تاريخًا بعد تاريخ.',
    'after_or_equal' => 'يجب أن تكون السمة تاريخًا بعد التاريخ أو مساويًا له.',
    'alpha' => 'يجب أن تحتوي السمة على أحرف فقط.',
    'alpha_dash' => 'يجب أن تحتوي السمة فقط على أحرف وأرقام وشرطات وشرطات سفلية.',
    'alpha_num' => 'يجب أن تحتوي السمة على أحرف وأرقام فقط.',
    'array' => 'يجب أن تكون السمة مصفوفة.',
    'ascii' => 'يجب أن تحتوي السمة على أحرف أبجدية رقمية ورموز أحادية البايت فقط.',
    'before' => 'يجب أن تكون السمة تاريخًا قبل التاريخ.',
    'before_or_equal' => 'يجب أن تكون السمة تاريخًا قبل التاريخ أو مساويًا له.',
    "between" => [
        'array' => 'يجب أن تكون السمة بين: min و: max items.',
        'file' => 'يجب أن تكون السمة بين: min و: max كيلوبايت.',
        'numeric' => 'يجب أن تكون السمة بين: min و: max.',
        'string' => 'يجب أن تكون السمة بين: min و: max حرفًا.'
    ],

    'boolean' => 'يجب أن يكون حقل السمة صحيحًا أو خطأ.',
    'confirmed' => 'تأكيد السمة غير متطابق.',
    'current_password' => 'كلمة المرور غير صحيحة.',
    'date' => 'السمة ليست تاريخًا صالحًا.',
    'date_equals' => 'يجب أن تكون السمة تاريخًا مساويًا للتاريخ.',
    'date_format' => 'السمة لا تطابق تاريخ التنسيق.',
    'decimal' => 'يجب أن تحتوي السمة على منازل عشرية.',
    'declined' => 'يجب رفض السمة.',
    'declined_id' => 'يجب رفض السمة عندما يكون الآخر هو القيمة.',
    'different' => 'يجب أن تكون السمة والأخرى مختلفة.',
    'digits' => 'يجب أن تتكون السمة من أرقام.',
    'digits_between' => 'يجب أن تكون السمة بين الحد الأدنى والحد الأقصى للأرقام.',
    'dimensions' => 'تحتوي السمة على أبعاد صورة غير صالحة.',
    'distinct' => 'يحتوي حقل السمة على قيمة مكررة.',
    'doesnt_end_with' => 'قد لا تنتهي السمة بإحدى القيم التالية.',
    'doesnt_start_with' => 'قد لا تبدأ السمة بإحدى القيم التالية.',
    'email' => 'يجب أن تكون السمة عنوان بريد إلكتروني صالحًا.',
    'end_with' => 'يجب أن تنتهي السمة بإحدى القيم التالية.',
    'enum' => 'السمة المحددة غير صالحة.',
    'exists' => 'السمة المحددة غير صالحة.',
    'file' => 'السمة يجب أن تكون ملفًا.',
    'filled' => 'يجب أن يحتوي حقل السمة على قيمة.',

    'gt' => [
        'array' => 'يجب أن تحتوي السمة على أكثر من عناصر ذات قيمة.',
        'file' => 'يجب أن تكون السمة أكبر من قيمة كيلوبايت.',
        'numeric' => 'يجب أن تكون السمة أكبر من القيمة.',
        'string' => 'يجب أن تكون السمة أكبر من أحرف القيمة.',
    ],
    'gte' => [
        'array' => 'يجب أن تحتوي السمة على: عناصر قيمة أو أكثر.',
        'file' => 'يجب أن تكون السمة أكبر من أو تساوي: value كيلوبايت.',
        'numeric' => 'يجب أن تكون السمة أكبر من القيمة أو مساوية لها.',
        'string' => 'يجب أن تكون السمة أكبر من أو تساوي أحرف القيمة.',
    ],

    'image' => 'يجب أن تكون السمة صورة.',
    'in' => 'السمة المحددة غير صالحة.',
    'in_array' => 'حقل السمة غير موجود في أخرى.',
    'integer' => 'يجب أن تكون السمة عددًا صحيحًا.',
    'ip' => 'يجب أن تكون السمة عنوان IP صالحًا.',
    'ipv4' => 'يجب أن تكون السمة عنوان IPv4 صالحًا.',
    'ipv6' => 'يجب أن تكون السمة عنوان IPv6 صالحًا.',
    'json' => 'يجب أن تكون السمة سلسلة JSON صالحة.',
    'lowercase' => 'يجب أن تكون السمة صغيرة.',
    'lt' => [
        'array' => 'يجب أن تحتوي السمة على عناصر أقل من القيمة.',
        'file' => 'يجب أن تكون السمة أقل من قيمة كيلوبايت.',
        'numeric' => 'يجب أن تكون السمة أقل من قيمة.',
        'string' => 'يجب أن تكون السمة أقل من أحرف القيمة.',
    ],
    'lte' => [
        'array' => 'يجب ألا تحتوي السمة على أكثر من عناصر ذات قيمة.',
        'file' => 'يجب أن تكون السمة أقل من أو تساوي القيمة بالكيلو بايت.',
        'numeric' => 'يجب أن تكون السمة أقل من القيمة أو مساوية لها.',
        'string' => 'يجب أن تكون السمة أقل من أو تساوي أحرف القيمة.',
    ],
    'mac_address' => 'يجب أن تكون السمة عنوان MAC صالحًا.',
    "max" => [
        'array' => 'يجب ألا تحتوي السمة على أكثر من كحد أقصى من العناصر.',
        'file' => 'يجب ألا تكون السمة أكبر من الحد الأقصى للكيلو بايت.',
        'numeric' => 'يجب ألا تكون السمة أكبر من الحد الأقصى.',
        'string' => 'يجب ألا تكون السمة أكبر من الحد الأقصى لعدد الأحرف.',
    ],
    'max_digits' => 'يجب ألا تحتوي السمة على أكثر من أرقام كحد أقصى.',
    'mimes' => 'يجب أن تكون السمة ملفًا من نوع القيم.',
    'mimetypes' => 'يجب أن تكون السمة ملفًا من قيم النوع.',
    'min' => [
        'array' => 'يجب أن تحتوي السمة على min من العناصر على الأقل.',
        'file' => 'يجب ألا تقل السمة عن دقيقة كيلوبايت.',
        'numeric' => 'يجب أن تكون السمة على الأقل دقيقة.',
        'string' => 'يجب أن تكون السمة على الأقل من الأحرف الدنيا.',
    ],
    'min_digits' => 'يجب أن تحتوي السمة على أقل عدد من الأرقام.',
    'multiple_of' => 'يجب أن تكون السمة من مضاعفات: value.',
    'not_in' => 'السمة المحددة غير صالحة.',
    'not_regex' => 'تنسيق السمة غير صالح.',
    'numeric' => 'يجب أن تكون السمة رقمًا.',
    "password" => [
        'letter' => 'يجب أن تحتوي السمة على حرف واحد على الأقل.',
        'mixed' => 'يجب أن تحتوي السمة على حرف كبير واحد وحرف صغير واحد على الأقل.',
        'numbers' => 'يجب أن تحتوي السمة على رقم واحد على الأقل.',
        'symbols' => 'يجب أن تحتوي السمة على رمز واحد على الأقل.',
        'uncompromised' => 'ظهرت السمة المحددة في تسرب بيانات. الرجاء اختيار سمة مختلفة. ',
    ],
    'present' => 'يجب أن يكون حقل السمة موجودًا.',
    'prohibited' => 'حقل السمة محظور.',
    'prohibited_if' => 'يُمنع حقل السمة عندما يكون الآخر هو القيمة.',
    'prohibited_unless' => 'حقل السمة محظور ما لم يكن الآخر في القيم.',
    'prohibits' => 'حقل السمة يمنع الآخرين من التواجد.',
    'regex' => 'تنسيق السمة غير صالح.',
    'required' => 'حقل السمة مطلوب.',
    'required_array_keys' => 'يجب أن يحتوي حقل السمة على إدخالات للقيم.',
    'required_if' => 'حقل السمة مطلوب عندما يكون الآخر هو القيمة.',
    'required_if_accepted' => 'حقل السمة مطلوب عند قبول الآخر.',
    'required_unless' => 'حقل السمة مطلوب ما لم يكن الآخر في: القيم.',
    'required_with' => 'حقل السمة مطلوب عندما تكون القيم موجودة.',
    'required_with_all' => 'حقل السمة مطلوب عند وجود القيم.',
    'required_without' => 'حقل السمة مطلوب عندما لا تكون القيم موجودة.',
    'required_without_all' => 'حقل السمة مطلوب في حالة عدم وجود أي من القيم.',
    'same' => 'يجب أن تتطابق السمة والأخرى.',

    "size" => [
        'array' => 'يجب أن تحتوي السمة على عناصر الحجم.',
        'file' => 'يجب أن يكون حجم السمة بالكيلو بايت.',
        'numeric' => 'يجب أن تكون السمة بالحجم.',
        'string' => 'يجب أن تكون السمة من الأحرف بالحجم.',
    ],
    'start_with' => 'يجب أن تبدأ السمة بإحدى القيم التالية.',
    'string' => 'يجب أن تكون السمة سلسلة.',
    'timezone' => 'يجب أن تكون السمة منطقة زمنية صالحة.',
    'unique' => 'السمة مأخوذة بالفعل.',
    'uploaded' => 'فشل تحميل السمة.',
    'uppercase' => 'يجب أن تكون السمة كبيرة.',
    'url' => 'يجب أن تكون السمة عنوان URL صالحًا.',
    'ulid' => 'يجب أن تكون السمة ULID صالحًا.',
    'uuid' => 'يجب أن تكون السمة UUID صالحًا.',

    "custom" => [
        'attribute-name' => [
            "rule-name" => "رسالة مخصصة",
        ],
        'roleId' => 'يجب أن يكون الدور موجودًا بالفعل ',
        "userId" => [
            "exists" => "يجب أن يكون المستخدم موجودًا بالفعل ",
        ]
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
