<?php
return [
    "common"=>[
        "submit-btn"=>"تحقق",
        'tel-match-err' => "يجب أن يبدأ :attribute بـ 05 أو 06 أو 07، يليه تسلسل محدد من 8 أرقام.",
        'fix-match-error' => "يجب أن يبدأ :attribute بـ 0، يليه تسلسل محدد من 8 أرقام.",
        'img-error' => 'يجب أن يكون الملف من نوع صورة',
        'user-id-error' => ":attribute مطلوب",
    ],
    "login"=>[
        "instruction"=>"يرجى تقديم المعلومات التالية",
        'email'=>"البريد الإلكتروني",
        'password'=>"كلمة المرور",
        "forget-password-link"=>"هل نسيت كلمة المرور؟",
        "register-link"=>"إنشاء حساب",
        "no-user-err"=>"لم يتم العثور على مستخدمين مطابقين مع البريد الإلكتروني وكلمة المرور المقدمة",
        "too-many-attempts"=>"تم حظر محاولة تسجيل الدخول مؤقتًا بسبب تكرار المحاولات الفاشلة. يرجى المحاولة مرة أخرى في غضون بضع دقائق"
    ],
    "register"=>[
        "first-f"=>[
            "instruction"=>"يجب أن يكون بريدك الإلكتروني صالحًا ، سيتم إرسال رمز التحقق إليك",
            "login-link"=>"لدي حساب بالفعل",
            "l-name"=>"اللقب",
            "f-name"=>"الاسم",
            "b-date"=>"تاريخ الميلاد",
            'email'=>"البريد الإلكتروني",
            'tel'=>"رقم الهاتف",
            'password'=>"كلمة المرور",
            "success-txt"=>"تم إرسال رمز التحقق إلى عنوان بريدك الإلكتروني"
        ],
        "second-f"=>[
            "instruction"=>"أدخل رمز التحقق الذي تم إرساله إليك",
            "new-code-btn"=>"الحصول على رمز تحقق جديد",
            'email'=>"البريد الإلكتروني",
            "code"=>"رمز التحقق",
            'code-err'=>"رمز التحقق غير صالح"
        ]

    ]
    ,
    "forget-pwd"=>[
        "first-f"=>[
            "instruction"=>"يجب أن يكون بريدك الإلكتروني صالحًا ، سيتم إرسال رمز التحقق إليك",
            "email"=>"البريد الإلكتروني",
            "success-txt"=>"تم إرسال رمز التحقق إلى عنوان بريدك الإلكتروني"
        ],
        "second-f"=>[
            "instruction"=>"أدخل رمز التحقق الذي تم إرساله إليك",
            'email'=>"البريد الإلكتروني",
            "code"=>"رمز التحقق",
            "password"=>"كلمة المرور الجديدة",
            "no-user"=>"لم يتم العثور على مستخدمين مطابقين باستخدام البريد الإلكتروني المقدم",
            "code-err"=>"رمز التحقق غير صالح"
        ]
        ],
        "change-email" => [
            "instruction" => "يجب أن يكون البريد الإلكتروني الجديد صالحًا",
            'old-email' => "البريد الإلكتروني القديم",
            "new-email" => "البريد الإلكتروني الجديد",
            "pwd" => "كلمة المرور",
            "no-user" => "تحقق من بريدك الإلكتروني القديم أو كلمة المرور الخاصة بك",
            "success-txt" => "لقد تم تغيير بريدك الإلكتروني. سيتم الآن تسجيل خروجك."
        ],
        "change-pwd" => [
            "instruction" => "يرجى تقديم المعلومات التالية:",
            "pwd" => "كلمة المرور القديمة",
            "new-pwd" => "كلمة المرور الجديدة",
            "pwd-err" => "تحقق من كلمة المرور القديمة الخاصة بك",
            "success-txt" => "تم تغيير كلمة المرور الخاصة بك. سيتم تسجيل خروجك الآن."
        ],
        "site-params"=>[
            "first-f"=>[
                "instruction"=>"يرجى تقديم المعلومات التالية:",
                "email"=>"البريد الإلكتروني",
                "password"=>"كلمة المرور",
                "no-user"=>"لم يتم العثور على مستخدمين مطابقين مع البريد الإلكتروني وكلمة المرور المقدمة",
                "no-access"=>"ليس لديك حق الوصول إلى الخطوة التالية",
                "success-txt"=>"كن حذرًا عند تغيير الحالة العامة للمنصة"
            ],
            "second-f"=>[
                "instruction"=>"إدارة حالة صيانة المنصة:",
                "disable"=>"تعطيل",
                "enable"=>"تمكين",
                "db-download-btn"=>"تحميل قاعدة البيانات",
                "no-db"=>"لا توجد نسخ احتياطية لقاعدة البيانات متاحة.",
                "state"=>"حالة صيانة المنصة",
                "success-txt"=>"لقد قمت بتغيير حالة الصيانة بنجاح"
            ]
            ],
     "user" => [
        "tel-match-err" => "يجب أن يبدأ رقم الهاتف بإحدى الأرقام 05، 06، أو 07، تليها تسلسل دقيق من 8 أرقام.",
        "add" => [
                    "success-txt" => "تم إنشاء المستخدم بنجاح",
                ],
       "update" => [
                    "success-txt" => "تم تحديث المستخدم بنجاح",
                ]
                ],
    'classroom' => [
                    'img-err' => 'يجب أن تكون الصورة بصيغة صورة',
                    'add' => [
                        'success-txt' => 'تم إنشاء  قاعة الدراسة بنجاح',
                    ],
                    'update' => [
                        'success-txt' => 'تم تحديث  قاعة الدراسة بنجاح',
                    ],
                ],

    'product' => [
                    'img-err' => 'يجب أن تكون الصورة بصيغة صورة',
                    'add' => [
                        'success-txt' => 'تم إنشاء المنتج بنجاح',
                    ],
                    'update' => [
                        'success-txt' => 'تم تحديث المنتج بنجاح',
                    ],
                ],
'training' => [
                    'add' => [
                        'success-txt' => 'تم إنشاء التدريب بنجاح',
                    ],
                    'update' => [
                        'success-txt' => 'تم تحديث التدريب بنجاح',
                    ],
                ],
"landing" => [
                        "landline" => "رقم الهاتف الثابت",
                        "phone" => "رقم الهاتف",
                        "fax" => "فاكس",
                        "map" => "خريطة جوجل",
                        "email" => "البريد الإلكتروني",
                        "logo" => "تغيير الشعار",

                             'update' => [
                                'success-txt' => 'تم تحديث الصفحة الرئيسية بنجاح',
                            ],

                    ],
'hero' => [
                        'title-fr' => 'العنوان بالفرنسية',
                        'title-ar' => 'العنوان بالعربية',
                        'sub-title-fr' => 'العنوان الفرعي بالفرنسية',
                        'sub-title-ar' => 'العنوان الفرعي بالعربية',
                        'image' => 'تحديث الصور',
                        'update' => [
                            'success-txt' => 'تم تحديث الترحيب بنجاح',
                        ],

                    ],
'aboutUs' => [
                        'titleFr' => 'العنوان بالفرنسية',
                        'titleAr' => 'العنوان بالعربية',
                        'descriptionAr' => 'الوصف بالعربية',
                        'descriptionFr' => 'الوصف بالفرنسية',
                        'image' => 'تغيير الصورة',
                        'update' => [
                            'success-txt' => 'تم تحديث صفحة من نحن بنجاح',
                        ],
                    ],
'ourQuality' => [
                        'nameFr' => 'الاسم بالفرنسية',
                        'nameAr' => 'الاسم بالعربية',
                        'image' => 'تغيير الصورة',
                        'add' => [
                            'success-txt' => 'تمت إضافة الجودة بنجاح',
                        ],
                        'update' => [
                            'success-txt' => 'تم تحديث الجودة بنجاح',
                        ],
                    ],
'socials' => [
                        'youtube' => 'يوتيوب',
                        'facebook' => 'فيسبوك',
                        'github' => 'جيت هاب',
                        'tiktok' => 'تيك توك',
                        'instagram' => 'إنستغرام',
                        'linkedin' => 'لينكدإن',
                        'update' => [
                            'success-txt' => 'تم تحديث حساباتك على وسائل التواصل الاجتماعي بنجاح',
                        ],
                    ],

"reservation"=>[
    'add' => [
        'success-txt' => 'لقد حجزت هذه القاعة بنجاح',
    ],
],
'message' => [
    'name' => 'الاسم',
    'message' => 'الرسالة',
    'email' => 'البريد الإلكتروني',
    'add' => [
        'success-txt' => 'تم إرسال رسالتك بنجاح',
    ],
],
];
