<?php
return [
    'common' => [
        'filters' => 'فتح الفلاتر',
        'resetFilters' => 'إعادة تعيين الفلاتر',
    ],
    'user' => [
        'excel' => [
            'download' => 'تحميل المستخدمين',
        ],
        'delete' => 'حذف المستخدم',
        'manage' => 'إدارة أدوار المستخدمين',
        'update' => 'تحديث المستخدم',
        'cv' => 'السيرة الذاتية للمدرب',
    ],
    'classroom' => [
        'delete' => 'حذف الفصل',
        'view' => 'عرض الفصل',
        'update' => 'تحديث الفصل',
        'dayOff' => 'إدارة أيام العطل',
    ],
    'dayOff' => [
        'delete' => 'حذف أيام العطل',
        'update' => 'تحديث أيام العطل',
    ],
    'training' => [
        'delete' => 'حذف التدريب',
        'view' => 'عرض التدريب',
        'update' => 'تحديث التدريب',
    ],
    'product' => [
        'delete' => 'حذف المنتج',
        'view' => 'عرض المنتج',
        'update' => 'تحديث المنتج',
    ],
    'ourQuality' => [
        'delete' => 'حذف الجودة',
        'update' => 'تحديث الجودة',
    ],
    'reservation' => [
        'excel' => [
            'download' => 'تحميل الحجوزات',
        ],
        'pdf' => 'طباعة التأكيد',
        'delete' => 'حذف الحجز',
        'update' => 'تحديث الحجز',
    ],
    'message' => [
        'reply' => 'الرد على الضيف',
        'delete' => 'حذف الرد',
    ],
];
